Revit 2026 API

# PipePlumbingFixtureFlowData Class

---

The input and output data used by external servers for calculation of the pipe plumbing fixture flow.

SystemObject Autodesk.Revit.DB.PlumbingPipePlumbingFixtureFlowData

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipePlumbingFixtureFlowData : IDisposable
```
```vb
Public Class PipePlumbingFixtureFlowData
	Implements IDisposable
```
```cpp
public ref class PipePlumbingFixtureFlowData : IDisposable
```
```fsharp
type PipePlumbingFixtureFlowData =
    class
        interface IDisposable
    end
```

The PipePlumbingFixtureFlowData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DimensionFlow | The dimension flow which is used to calculate flow of the pipe. Units: (gal/min). |
|  | FixtureUnits | The fixture units of the pipe. |
|  | Flow | The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min). |
|  | FlowConfiguration | The flow configuration mode of the pipe. |
|  | FlowConversionMode | The flow conversion mode of the pipe. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PipePlumbingFixtureFlowData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

FlowConfiguration, FixtureUnits, FlowConversionMode, and DimensionFlow are input field values for the calculation. Flow is output field value for the calculation.

#### Reference

Autodesk.Revit.DB.Plumbing Namespace